#create_clock -name clk2 -period 12 [get_ports {clk_2}]
create_clock -name clk1 -period 10 [get_ports {clk_2}]
#set_input_delay -clock { clk1 } -max -add_delay 3.25 [get_ports {D0_D3}]
set_input_delay -clock { clk1 } -max 3.25 [get_ports {D0_D3[0] D0_D3[1] D0_D3[2] D0_D3[3]}]
set_input_delay -clock { clk1 } -min 1.75 [get_ports {D0_D3[0] D0_D3[1] D0_D3[2] D0_D3[3]}]
#set_output_delay -clock { clk1 } -min 0.0 [get_ports {data_bus [0] data_bus [1] data_bus [2] data_bus [3]}]
set_output_delay -clock { clk1 } -min 0.1 [get_ports {data_bus[0] data_bus[1] data_bus[2] data_bus[3]}]
set_output_delay -clock { clk1 } -max 0.7 [get_ports {data_bus[0] data_bus[1] data_bus[2] data_bus[3]}]
#set_output_delay -clock { clk1 } -min 0.0 [get_ports {data_bus [0] data_bus [1] data_bus [2] data_bus [3]}]
#set_input_delay -clock { clk2 } -max -add_delay 3.25 [get_ports {D0_D3}]
#set_input_delay -clock { clk2 } -min -add_delay 1.75 [get_ports {D0_D3}]
#set_output_delay -clock { clk1 } -max  0.7 [get_ports {data_bus [0] {data_bus [1] {data_bus [2] {data_bus [3]}]
#set_output_delay -clock { clk2 } -max -add_delay 0.7 [get_ports {data_bus}]
#set_output_delay -clock { clk2 } -min -add_delay 0.0 [get_ports {data_bus}]
